In [1]:
import pandas as pd

### 데이터 불러오기

In [2]:
sample_1 = pd.read_excel('./예제파일/01_초판/2_Start_DataAnalysis/files/sample_1.xlsx', 
                        header=1, skipfooter=2, usecols='A:C')
sample_1.head(3)

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319

In [3]:
# header = 1은 칼럼명이 있는 위치, 시작숫자가 1이 아닌 0이기 때문에 두번째 로우를 표현할 때는 1로 나타냅니다.

In [4]:
# skipfooter = 2 는 마지막 로우에서 두줄은 생략하고 불러옵니다.

In [5]:
# usecols ='A:C' A칼럼부터 C칼럼까지 불러옵니다.

In [6]:
sample_1.tail(3) #마지막 3줄을 잘라옵니다.

  국적코드  성별    입국객수
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [7]:
sample_1.info() # info()함수는 데이터에 대한 요약정보를 제공

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [8]:
sample_1.describe() # describe() 함수는 숫자형 변수에 대한 여러가지 통계량을 출력하는 함수

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

In [9]:
sample_1

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [10]:
sample_1['입국객수']

0    106320
1    191436
2       319
3        42
4    158912
5    232943
Name: 입국객수, dtype: int64

In [11]:
sample_1[['국적코드','입국객수']]

  국적코드    입국객수
0  A01  106320
1  A01  191436
2  A31     319
3  A31      42
4  A18  158912
5  A18  232943

In [12]:
sample_1['기준년월'] = '2019-11'

In [13]:
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [14]:
# 성별이 남성인 경우만
condition = (sample_1['성별'] == '남성')

In [15]:
condition

0     True
1    False
2     True
3    False
4     True
5    False
Name: 성별, dtype: bool

In [16]:
sample_1[condition]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11

In [17]:
#입국객수가 150000명 이상인 경우만
condition = (sample_1['입국객수'] >= 150000)

In [18]:
sample_1[condition]

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [19]:
# 성별이 남성이면서 입국객수가 150000명 이상인 경우 (AND)
conditions = (sample_1['성별'] == '남성') & (sample_1['입국객수'] >= 150000)
sample_1[conditions]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2019-11

In [20]:
# 성별이 남성이거나 입국객수가 150000명 이상인 경우 (OR)
conditions = (sample_1['성별'] == '남성') \
|(sample_1['입국객수'] >= 150000)

In [21]:
sample_1[conditions]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

### 데이터 선택 - 칼럼기준

In [22]:
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [23]:
sample_1['입국객수']

0    106320
1    191436
2       319
3        42
4    158912
5    232943
Name: 입국객수, dtype: int64

In [24]:
sample_1[['국적코드','입국객수']] # 여러개의 칼럼을 선택하기 위해서는 여러개의 칼럼을 리스트로 묶어서 입력

  국적코드    입국객수
0  A01  106320
1  A01  191436
2  A31     319
3  A31      42
4  A18  158912
5  A18  232943

In [25]:
sample_1['기준년월'] = '2019-11' # 기존에 존재하지 않았던 '기준년월'이라는 칼럼에 '2019-01'이라는 값 부여하기
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

### 데이터 선택 - 로우기준

In [26]:
# 일반적으로 로우를 선택하는 경우는 특정 조건에 맞는 데이터를 필터링한 결과를 찾을때

In [27]:
condition = (sample_1['성별'] == '남성')
condition

0     True
1    False
2     True
3    False
4     True
5    False
Name: 성별, dtype: bool

In [28]:
sample_1[condition]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11

In [29]:
# 입국객수가 150000 이상인 경우 
condition = (sample_1['입국객수'] >= 150000)
sample_1[condition]

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [30]:
# 성별이 남성이면서 입국객수가 150000 이상인 경우
condition = (sample_1['성별'] == '남성') & (sample_1['입국객수'] >= 150000)
sample_1[condition]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2019-11

In [31]:
# 성별이 남성이면서 입국객수가 150000 이상인 경우
condition = (sample_1['성별'] == '남성') \
            & (sample_1['입국객수'] >= 150000)
sample_1[condition]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2019-11

In [32]:
# 성별이 남성이거나 입국객수가 150000 이상인 경우
condition = (sample_1['성별'] == '남성') | (sample_1['입국객수'] >= 150000)
sample_1[condition]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [33]:
condition = (sample_1['국적코드'].isin(['A01', 'A18'])) # isin() 함수안에 찾고 싶은 값을 리스트형태로 넣어준다 (or와 같은 기능)
condition

0     True
1     True
2    False
3    False
4     True
5     True
Name: 국적코드, dtype: bool

In [34]:
sample_1[condition]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [35]:
condition = (sample_1['국적코드'].isin(['A01', 'A18'])) 
sample_1[condition == False] # 조건에 해당하지 않을 경우

  국적코드  성별  입국객수     기준년월
2  A31  남성   319  2019-11
3  A31  여성    42  2019-11

### 데이터 통합 - 옆으로 통합(merge)

In [36]:
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [37]:
code_master = pd.read_excel('./예제파일/01_초판/2_Start_DataAnalysis/files/sample_codemaster.xlsx')
code_master

  국적코드     국적명
0  A01      일본
1  A02      대만
2  A03      홍콩
3  A18      중국
4  A19      이란
5  A22  우즈베키스탄
6  A23   카자흐스탄
7  A99  아시아 기타

In [38]:
sample_1_code = pd.merge(left = sample_1,
                         right = code_master,
                         how = 'left',
                         left_on = '국적코드',
                         right_on = '국적코드')
sample_1_code

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국

In [39]:
# pd.merge() 함수는 기준 테이블과 정보를 결합하고 싶은 테이블 간에 공통된 칼럼에 대해 같은 값을 찾아서 결합해 하나의 테이블로 만든다.

In [40]:
# how ='left' 왼쪽 테이블을 기준으로 두 테이블을 결합하겠다
# left_on = '국적코드' 왼쪽 테이블의 기준 칼럽은 국적코드이다
# right_on = '국적코드' 오른쪽 테이블의 기준 칼럼은 국적코드이다

In [41]:
sample_1_code_inner = pd.merge(left = sample_1,
                              right = code_master,
                              how='inner', 
                              left_on = '국적코드',
                              right_on = '국적코드')
sample_1_code_inner

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성  106320  2019-11  일본
1  A01  여성  191436  2019-11  일본
2  A18  남성  158912  2019-11  중국
3  A18  여성  232943  2019-11  중국

In [42]:
# inner는 두 테이블의 기준 칼럼의 값이 서로 일치하는 경우에만 데이터를 통합하는 옵션

### 데이터 통합 - 아래로 통합(append)

In [43]:
sample_2 = pd.read_excel('./예제파일/01_초판/2_Start_DataAnalysis/files/sample_2.xlsx',
                        header = 1,
                        skipfooter=2,
                        usecols='A:C')
sample_2['기준년월'] = '2019-12'
sample_2_code = pd.merge(left=sample_2,
                        right=code_master,
                        how='left',
                        left_on = '국적코드',
                        right_on = '국적코드')
sample_2_code

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성   92556  2019-12  일본
1  A01  여성  163737  2019-12  일본
2  A18  남성  155540  2019-12  중국
3  A18  여성  249023  2019-12  중국

In [44]:
sample_1_code

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국

In [45]:
# 데이터를 통합하기 위해선 칼럼 순서가 동일해야 한다

In [46]:
sample = sample_1_code.append(sample_2_code, ignore_index = True)
sample

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국
6  A01  남성   92556  2019-12   일본
7  A01  여성  163737  2019-12   일본
8  A18  남성  155540  2019-12   중국
9  A18  여성  249023  2019-12   중국

In [47]:
# append() 함수를 사용해 sample_1_code의 칼럼을 기준으로 sample_2_code 데이터를 통합

In [48]:
sample_1_code.append(sample_2_code)

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국
0  A01  남성   92556  2019-12   일본
1  A01  여성  163737  2019-12   일본
2  A18  남성  155540  2019-12   중국
3  A18  여성  249023  2019-12   중국

In [49]:
# ignore_index = True 를 지정하지 않으면 원래 각 데이터에서의 인덱스 값으로 합쳐지므로 일반적으로 ignore = True 를 권장

### 데이터 저장

In [50]:
sample

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국
6  A01  남성   92556  2019-12   일본
7  A01  여성  163737  2019-12   일본
8  A18  남성  155540  2019-12   중국
9  A18  여성  249023  2019-12   중국

In [51]:
sample.to_excel('./files/sample.xlsx')

In [53]:
sample.to_excel('./files/sample_index_false.xlsx', index = False)

### 데이터 집계(pivot table)

In [54]:
# 피벗 테이블이란 기존 데이터의 칼럼을 재구성해서 데이터에 대한 통계를 한눈에 파악할 수 있게 정리한 표

In [55]:
# 피벗 기능을 이용하면 데이터를 원하는 형태로 손쉽게 집계할 수 있다

In [58]:
sample_pivot = sample.pivot_table(values ='입국객수',
                                 index = '국적명',
                                 columns = '기준년월',
                                 aggfunc = 'mean')
sample_pivot

기준년월   2019-11   2019-12
국적명
일본    148878.0  128146.5
중국    195927.5  202281.5

In [59]:
# values = '입국객수' : 피벗 테이블 내부에 들어갈 값은 입국객수로 한다
# index = '국적명' : row에 국적명을 배치한다
# columns = '기준년월' : column에 기준년월을 배치한다
# aggfunc = 'mean' : value를 index와 columns 기준으로 평균을 계산한다

In [60]:
#index와 column이 항상 있어야 하는 것은 아니다

In [61]:
sample_pivot_2 = sample.pivot_table(values = '입국객수',
                                   index = '국적명',
                                   aggfunc = 'mean')
sample_pivot_2

          입국객수
국적명
일본   138512.25
중국   199104.50